app/controllers/quizzes_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."quiz_id" = ? ORDER BY "questions"."position" ASC  [["quiz_id", 4]]
---
  def show
    @quiz = Quiz.find(params[:id])
    @questions = @quiz.questions.order(:position)

SELECT  "questions".* FROM "questions" WHERE "questions"."quiz_id" = ? AND "questions"."id" = ? LIMIT ?  [["quiz_id", 4], ["id", nil], ["LIMIT", 1]]
---
  def edit
    @quiz = Quiz.find(params[:id])
    @questions = @quiz.questions.all